# 通过for循环，对所有级别为1级的员工，级别上升1级，薪水增加1000元
my_dict = {
    "王力鸿": {"部门": "科技部", "工资": 3000, "级别": 1},
    "周杰轮": {"部门": "市场部", "工资": 5000, "级别": 2},
    "林俊节": {"部门": "市场部", "工资": 7000, "级别": 3},
    "张学油": {"部门": "科技部", "工资": 4000, "级别": 1},
    "刘德滑": {"部门": "市场部", "工资": 6000, "级别": 2},
}
print("--------------加薪前--------------")
for ele in my_dict.keys():
    print(ele+"：",end="")
    print(my_dict[ele])
print("--------------加薪后--------------")
for ele in my_dict.keys():
    if my_dict[ele]["级别"] == 1:
        my_dict[ele]["级别"] += 1
        my_dict[ele]["工资"] += 1000
    print(my_dict)
    print(ele + "：", end="")
    print(my_dict[ele])
